# 计算机网络应用大赛

## 10190419省赛-河北石家庄

## 20190615国赛-福建福州

----

### 交换机命名及常见命令

> show service 当前服务的一些状态  
enable service web-server   开启web
关闭时在前面加no

> Ruijie>`en`  
> Ruijie#`configure terminal`  
> Ruijie(config)#`hostname Switch`  ------>设置交换机的名字为"Switch"  
> Switch(config)#`end`  
> Switch#`write`     ------>确认配置正确，保存配置  
> `Switch#show run` 查看配置  
> `reload` 重启  

----
> `show interface desription`***查看接口配置，描述，在线状态***  


> 对交换机的g0/1口进行描述
> Ruijie#`configure terminal`  
> Ruijie(config)#`interface gigabitEthernet 0/1`  
> Ruijie(config-if-GigabitEthernet 0/1)#`description Con_To_R1_Gi0/0`
> Ruijie(config-if-GigabitEthernet 0/1)#`end`  
> Ruijie#`write`  
>利用文本文档来批量更改，例：  
>>int Gi0/1  
des Con_To_PC1  
int Gi0/21  
des Con_To_AP1_Gi0/1  
int Gi0/22  
des BFD  
int Gi0/23  
des Con_To_S3_Gi0/1  
int Gi0/24  
des Con_To_S4_Gi0/1  
int Te0/27  
des Con_To_S2_Te0/27  
int Te0/28  
des Con_To_S2_Te0/28  


----

密码恢复未测试

----

SSH时使用用户名及密码登入交换机

> Ruijie(config)#`line vty 0 4`                                            ------>进入SSH密码配置模式，0 4表示允许共5个用户同时SSH登入到交换机  
> Ruijie(config-line)#`login local`                                       ------>启用SSH时使用本地用户和密码功能  
> Ruijie(config-line)#`exit`                                                 ------>回到全局配置模式  
> Ruijie(config)#`username admin password admin`           ------>配置远程登入的用户名为admin，密码为admin
> Ruijie(config)#`enable password  admin`                    ------>配置进入特权模式的密码为admin  
> Ruijie(config)#`end`                                                        ------>退出到特权模式  
> Ruijie#`write`                                                                  ------>确认配置正确，保存配置  

----
ssh
> 查看SSH服务：`show service`  

----

> 创建VLAN：`vlan 10`  
配置vlan名字：`name ###`  
进入vlan接口配置IP：`interface vlan 10`  
`ip address x.x.x.x 掩码`  

----

SNMP配置：
> `snmp-server community ruijie rw`    --读写  
`snmp-server community public ro`    --只读  
`snmp-server enable traps`    --开启traps  
`snmp-server host 192.168.1.10 traps version 2c ruijie`  
`snmp-server host 192.168.1.10 traps version 2c public`  
----
堆叠  
> S2910-24GT4XS-E-1 的堆叠交配置  
S2910-24GT4XS-E-1# `configure terminal`  
S2910-24GT4XS-E-1(config)# `switch virtual domain 1`     ------>创建VSU domain id  

> S2910-24GT4XS-E-1(config-vs-domain)# `switch 1`          ------>创建switch id  

> S2910-24GT4XS-E-1(config-vs-domain)# `switch 1 priority 200`  ------>配置switch id的优先级  

> S2910-24GT4XS-E-1(config-vs-domain)# `switch 1 description S2910-24GT4XS-E-1`   ------>配置switch id的描述信息  

> S2910-24GT4XS-E-1(config-vs-domain)# `exit`  

> S2910-24GT4XS-E-1(config)# `vsl-port`------>进入VSL配置模式，建议至少采用2条VSL链路来提升VSU的可靠性，如果条件限制，一条VSL链路也可以  

> S2910-24GT4XS-E-1(config-vsl-port)# `port-member interface  Tengigabitethernet 0/27`  ------>将Tengigabitethernet 1/0/27加入VSL  

> S2910-24GT4XS-E-1(config-vsl-port)# `port-member interface  Tengigabitethernet 0/28`  ------>将Tengigabitethernet 1/0/28加入VSL  

>S2910-24GT4XS-E-1(config-vsl-port)# `exit`  
S2910-24GT4XS-E-1(config)# `exit`  
`write`  
> BX-VSU-S2910#`switch  convert mode  virtual`切换为堆叠模式  
----
> Ruijie#`configure terminal`  

> Ruijie(config)#`interface GigabitEthernet 1/0/22`  ------>第一台VSU设备的第22个接口

> Ruijie(config-if-GigabitEthernet 1/0/22)#`no switchport`   ------>只需要在BFD接口上敲no sw，无需其他配置

> Ruijie(config-if-GigabitEthernet 1/0/24)#`exit`

> Ruijie(config)#`interface GigabitEthernet 2/0/22`  ------>第二台VSU设备的第22个接口

> Ruijie(config-if-GigabitEthernet 1/0/22)#`no switchport`   ------>只需要在BFD接口上敲no sw，无需其他配置  

> Ruijie(config-if-GigabitEthernet 2/0/24)#`exit`  

> Ruijie(config)#`switch virtual domain 1`  

> Ruijie(config-vs-domain)#`dual-active detection bfd`

> Ruijie(config-vs-domain)#`dual-active bfd interface GigabitEthernet 1/0/22`

> Ruijie(config-vs-domain)#`dual-active bfd interface GigabitEthernet 2/0/22`
----

> 生成树：  
开启生成树：`spanning-tree`  
接口下配置：  
开启bpdu:  
`spanning-tree bpduguard enable`  
恢复时间：  
`errdisable recovery interval 300`  
配置RLDP:  
`rldp enable`  
`rldp port loop-detect shutdown-port`  
风暴限制：  
广播 `storm-control broadcast level 2`  
--2表示限制等级  
组播 `storm-control multicast level 2`  
未知单播 `storm-control unicast level 2`
  
----

> 配置MSTP：
指定类型：`spanning-tree mode mstp`  
配置优先级：`spanning-tree priority 4094`  
进入mst视图：`spanning-tree mst configuration`  
`name ruijie`   --名字  
`revision 1`     --版本  

----

### 路由

----

### AC AP

通用进web
>`enable service web-server` 开启web 关闭时在前面加no  
`int vlan 1` 进入vlan1口  
`ip add 192.168.100.1 24` 设置web的ip  
配置pc的ip在同一个网段即可  
----
19样题进web
> Ruijie(config)#`vlan 100`  
Ruijie(config-vlan)#`int vlan 100`  
Ruijie(config-if-VLAN 100)#`ip address 192.168.100.2 24`  
Ruijie(config-if-VLAN 100)#`exit`  
Ruijie(config)#`int gigabitEthernet 0/1`  
Ruijie(config-if-GigabitEthernet 0/1)#`switchport access vlan 100`  
>

----

### EG

----

### 云平台部分

> 装图形化  
>> [root@localhost /]# `yum grouplist`  
[root@localhost /]# `yum groupinstall "Server with GUI" "System Administration Tools"`  
[root@localhost /]# `startx` 


> `static` 静态

> BOOTPROTO=static  
IPADDR=192.168.0.11(改成要设置的IP)  
NETMASK=255.255.255.0 (子网掩码)  
GATEWAY=192.168.0.1(网关)  
ONBOO=yes  
然后  
service network restart  
怕忘。。。

